# # 입력
# raw = input("정수를 입력해주세요: ")
# l = raw[-1]

# # 짝수 또는 홀수
# ## 짝수 : 02468
# if l == "0" or l == "2" or l ==\
#     "4" or l == "6" or l =="8":
#     print("짝수입니다")

# ## 홀수 : 13579
# if l == "1" or l == "3" or l ==\
#     "5" or l == "7" or l =="9":
#     print("홀수입니다")

###
# a = float(input("> 1번째 숫자: "))
# b = float(input("> 2번째 숫자: "))
# print()


# if a > b:
#     print("처음 입력했던 {}가 {}보다 큽니다.".format(a,b))
# if a < b:
#     print("두번째로 입력했던 {}가 {}본 큽니다.".format(a,b))    

# # > 1번째 숫자 : 100
# # > 2번째 숫자 : 10
# #
# # 처음 입력했던 100.0가 10.0보다 큽니다.

23강
03-2 if~else와 elif
