
# 함수사용
# 1. 긴 구문을 구현후 계속사용하기 위해
# 2. 프로그램을 간결하게 하기 위해

# 함구
# def 이름():
# 구문

# def print1():
#     print("안녕하세요.")
#     print("안녕하세요.")
#     print("안녕하세요.")

# print1()



# 학생성적표 연습
# def stu_puint():
#     for s in stu:
#             print("{},{},{},{},{},{},{:.2f}".format(*s))

# stu = [
#     [1,"홍길동",100,100,100,300,100.0],
#     [2,"유관순",100,100,100,300,100.0],
#     [3,"이순신",100,100,100,300,100.0]
# ]

# # stu = [
# #     [1,"홍길동",100,100,100],
# #     [2,"유관순",100,100,100],
# #     [3,"이순신",100,100,100]
# # ]
# while True:
#     print("-"*60)
#     print("1. 학생성적입력")
#     print("2. 학생성적출력")
#     print("-"*60)
#     print("3. 학생성적검색")

#     choice = int(input("원하는 번호를 입력하세요.>> "))
#     if choice == 1:
#         name = input("학생이름입력 (0.이전페이지 이동): ")
#         if name=="0":
#                 break           
#         # 학생전체출력
#         # for s in stu:
#         #     print("{},{},{},{},{},{},{:.2f}".format(*s))
#         stu_puint()
#     elif choice == 2:
#         # 학생출력하는 구문
#         print("번호\t이름\t국어\t영어\t수학\t합계\t평균")
#         # 학생전체출력
#         stu_puint()
#         # for s in stu:
#         #     print("{},{},{},{},{},{},{:.2f}".format(*s))
#     else:
#         name = input("이름을 입력하세요.")







